{"title":"Two small problems in topology","author":"M. S","type":"technical","date":"2019/09/15","thumb":"assets/img/technical/crc.jpg","body":[{"type":2,"content":"This originally intended to serve as an introduction to topology, but ultimately didn’t go into my dissertation. Contains material from <a href=\"https://www.3blue1brown.com/\">3Blue1Brown</a>."},{"type":0,"content":"Introduction"},{"type":2,"content":"Topology investigates the fundamental structural properties of objects, that can be identified by looking at said objects regardless of any geometrical representation or measure. For that purpose, <i>homeomorphism</i> is a central concept, based on the notion of continuity, that allows us to construct a topological characterization, so as to group objects, called <i>topological spaces</i>, in equivalence classes. Nonetheless, it proves quite difficult in practice to demonstrate that two objects are homeomorphic using only continuity. Topologists would rather make use of the concept of <i>invariants</i>, which are computable quantities (or algebraic structures) that stay the same for all objects that are homeomorphic to one another. It can be seen as a way to introduce back the concept of measure, in a more fundamental sense, to study topological objects. "},{"type":2,"content":"In the following, we will try to give some insights about what topology can actually do, based on two concrete examples, for readers who are not necessarily well acquainted with the subject. This is the occasion to present some of its core concepts in a non-formal manner. "},{"type":0,"content":"I. Inscribed rectangle problem"},{"type":2,"content":"(<b>Inscribed rectangle problem</b>) Given any non-self-intersecting continuous loop <small>$S$</small> in the Euclidean plane, can one always find a rectangle whose vertices are on <small>$S$</small>?"},{"type":2,"content":"In other words, the problem is to find whether there are two distinct pairs of points, <small>$\\{x_1,y_1\\} \\in S^2$</small>, and <small>$\\{x_2,y_2\\} \\in S^2$</small>, which form two segments of equal length and sharing a midpoint (Fig. 1, left). A quite simple solution to this problem, involving topology, is given in [<i>Balancing acts</i>, M. Meyerson, 1981; <i>Rectangles and simple closed curves</i>, H. Vaughan, 1977]. Let us denote <small>$M$</small> the set of (unordered) pairs of points in the closed curve <small>$S$</small>: <small>$M=\\{ \\{x,y\\}, (x,y)\\in S^2\\}$</small> and furthermore <small>$M$</small> can be understood as a two-dimensional surface: every element <small>$\\{x,y\\}$</small> of <small>$M$</small> can be plotted, for example, on a square part of the plane, with its abscissa corresponding to the choice of <small>$x$</small> and its ordinate corresponding to the choice of <small>$y$</small>. Here pairs are unordered, so <small>$\\{x,y\\}=\\{y,x\\}$</small>. By identifying the symmetric points <small>$\\{x,y\\}$</small> with <small>$\\{y,x\\}$</small>, and by properly identifying extremal segments of the square (because <small>$S$</small> is a loop), <small>$M$</small> can be shown to have the same topological structure as a Möbius strip (Fig. 1, right). "},{"type":4,"content":"assets/img/technical/closed-rectangle-curve.jpg"},{"type":2,"content":"Figure 1 - A closed curve with an inscribed rectangle (left), the rectangle is defined by the pairs of points forming its diagonal (center). Every unordered pair of points in a closed curve can be uniquely mapped to a point in a Möbius strip (right, 3D model adapted from <a href=\"http://www.craftsmanspace.com\">craftmanspace</a>)."},{"type":2,"content":"Now let us consider the function <small>$f: M \\to \\mathbb{R}^3$</small>, associating each pair of points <small>$\\{x,y\\}$</small> with the point whose first two coordinates give the midpoint of segment <small>$(xy)$</small> and whose third coordinate is the length of <small>$(xy)$</small>. <small>$f(M)$</small> can be seen as a two-dimensional surface which lies in the half-space <small>$z\\geq0$</small> and meets <small>$z=0$</small> in its boundary <small>$S$</small> (Fig. 2). Furthermore, by virtue of the continuity of <small>$f$</small>, <small>$f(M)$</small> is also a Möbius strip. The problem of finding an inscribed rectangle in <small>$S$</small> is then equivalent to the problem of finding a point in <small>$f(M)$</small> which is the image of two distinct elements of <small>$M$</small>; in other words, a self-intersection of the surface <small>$f(M)$</small>. But by adding the interior of <small>$S$</small> (a disk) to <small>$f(M)$</small> (a Möbius strip), one gets a <i>projective plane</i>, which has no embedding in <small>$\\mathbb{R}^3$</small>, as topology states [<i>Algebraic Topology</i>, A. Hatcher, 2000]. In other words, there exists no way to represent <small>$f(M)$</small> as a non-intersecting <small>$2$</small>-dimensional surface in a <small>$3$</small>-dimensional space, so a self-intersection of <small>$f(M)$</small> must exist. "},{"type":4,"content":"assets/img/technical/curve-pegrectangle-reduced.jpg"},{"type":2,"content":"Figure 2 - A pair of points in a closed curve <small>$\\frak{C}$</small> (left) is mapped by the function <small>$f$</small> to a point in the upper 3D space. The image of pairs of points in <small>$\\frak{C}$</small> by <small>$f$</small> is a two-dimensional surface (right) whose self-intersections correspond to a rectangle inscribed in <small>$\\frak{C}$</small>."},{"type":2,"content":"This first example shows that the study of topology can bring out coarse truths about problems (not necessarily formulated in terms of geometry), and can lead to understand deep properties that a broad class of geometric or continuous objects can or cannot have. Note that absolutely no computation was necessary to prove that there is always an inscribed rectangle in a closed curve, yet no real practical way to find such a rectangle was provided. "},{"type":2,"content":"A small JavaScript demo showing the self-intersecting surface is available <a href=\"https://madblade.github.io/self-curve/\">here</a> (<a href=\"https://github.com/madblade/self-curve\">Source code</a>). "},{"type":0,"content":"II. Splitting Necklace"},{"type":2,"content":"The interest of topology, though, is not limited to proving the existence or non-existence of solutions to abstract, theoretical problems. A recently developed field of topology involving <i>continuous functions</i>, called <i>Morse theory</i> [<i>Morse theory indomitable</i>, R. Bott, 1988], popularized by Milnor [<i>Morse Theory</i>, Milnor, 1963] and which found many applications in computing [<i>Computational Topology</i>, H. Edelsbrunner and J. Harer, 2009] and proved very useful to the understanding of large data. Let us see, in another example, how topology relates not only to the mere concept of space, but also to <i>functions</i> defined on them (with sufficiently nice smoothness properties). "},{"type":2,"content":"(<b>Necklace splitting problem</b>) A necklace has <small>$2n$</small> beads of two different colors, arranged in some order. What is the smallest number of cuts necessary to split the necklace evenly, so that beads of each color can be equally shared between two partners? "},{"type":2,"content":"The question asked here is to minimize the number of cuts made to the necklace, with the constraint that there must be a fair assignment of the resulting fragments between two individuals Alice and Bob (note that such optimization issues are quite common in engineering and computing applications [<i>How to assemble tree machines</i>, Bhatt et al., 1982]). Incidentally, this problem has a connection to an important result in topology: the Borsuk-Ulam theorem [<i>The Borsuk-Ulam theorem and bisection of necklaces</i>, Alon et al., 1986]. "},{"type":2,"content":"In the case where beads are only of two distinct colors, the optimal number of cuts is two. To demonstrate this fact, let us give a continuous formulation of the problem. Instead of a necklace with a discrete number of beads, consider a segment <small>$I=(0,1)$</small> divided in continuous intervals of two different colors (the discrete problem is the special case where the length of all intervals are a multiple of some basic length). The problem is then to find two cuts that divide <small>$I$</small> into three fragments, so that an equal length of each color can be distributed to Alice and Bob (Fig. 3, left). "},{"type":4,"content":"assets/img/technical/necklace-text.jpg"},{"type":2,"content":"Beads in a necklace can be shared between Alice and Bob with two cuts (left). The continuous formulation of the problem considers lengths of colors instead of discrete beads (center). The parameter space of cutting and distributing three fragments is a sphere and the amount of colors given to Alice defines a vector field on this sphere (right). "},{"type":2,"content":"Remark that the choice of two cuts that yield three fragments is equivalent to the choice of three positive numbers <small>$a$</small>, <small>$b$</small> and <small>$c$</small> so that <small>$a+b+c=1$</small>. Then, the choice of an assignment of those fragments between two partners is equivalent to give the numbers <small>$a$</small>, <small>$b$</small> and <small>$c$</small> two possible states, say <i>Alice</i> or <i>Bob</i>. Ingeniously, one could simultaneously represent the choice of two cuts of <small>$I$</small> and their assignment in the following manner: choose three numbers <small>$x$</small>, <small>$y$</small> and <small>$z$</small>, so that <small>$x^2+y^2+z^2=1$</small>, with <small>$x^2$</small>, <small>$y^2$</small> and <small>$z^2$</small> defining the lengths of fragments, and the sign of <small>$x$</small>, <small>$y$</small> and <small>$z$</small> defining an assignment of the fragments (say positive for Alice and negative for Bob). Notice that <small>$x^2+y^2+z^2=1$</small> is actually the equation of a (two-)sphere in <small>$\\mathbb{R}^3$</small> centered at the origin, so every point on the sphere corresponds to two cuts and an assignment. Swapping a given assignment of fragments between Alice and Bob amounts to reverting the sign of <small>$x$</small>, <small>$y$</small> and <small>$z$</small>, so <i>antipodal</i> points on the sphere correspond to swapped assignments. "},{"type":2,"content":"In this setup, remember that every point on the sphere is associated with the length of each color given to Alice (Fig. 3, right). Then, if two antipodal points give the same length of each color to Alice, then they correspond to a balanced assignment of colors. But do such antipodal points exist? The important topological fact, mentioned earlier, actually gives the answer to this question: "},{"type":2,"content":"<b>Theorem</b> (<b>Borsuk-Ulam</b>): For every continuous function <small>$f: S_2 \\to \\mathbb{R}^2$</small>, there exists a point <small>$(x,y,z)\\in S_2$</small> such that <small>$f(x,y,z) = f(-x,-y,-z)$</small>."},{"type":2,"content":"Less formally, it states that if one defines a continuous <i>vector field</i> on the surface of a sphere, then the sphere admits a pair of antipodal points having exactly the same vector field value. For example, the Borsuk-Ulam theorem assures us that there exists a pair of diametrically opposed points on the surface of the Earth where the pressure and temperature are precisely the same (given pressure and temperature fields are two-dimensional and continuous). "},{"type":2,"content":"Now considering the function <small>$f$</small> which takes the points on the sphere as an input (corresponding to two cuts and an assignment), and outputs a couple <small>$(c_1,c_2)$</small>, indicating the length of each color given to Alice, <small>$f$</small> is continuous, and we have all the ingredients to conclude that two cuts at most are necessary to split the necklace evenly. This approach using the Borsuk-Ulam theorem generalizes to higher dimensions [Alon 1986], i.e. for necklaces with a higher number of colors. "},{"type":2,"content":"As illustrated with this more practical example, Topology can indeed provide insights about spaces as well as functions defined on spaces. In engineering and scientific applications, large volumes of data are often found in the form of a well-known (geometrical or topological) space, on which <i>scalar fields</i> or <i>vector fields</i> are defined. The question often asked is to analyze the properties of such fields. Interestingly, apart from the Borsuk-Ulam theorem, there are other deep relations between functions and the space on which they are defined. The field of Morse theory, mentioned earlier, precisely examines this relationship. It relies on the central notions of <i>manifold</i>, <i>continuity</i>, <i>homeomorphism</i>, and <i>critical points</i>. "}],"id":30003}